#include "help.h"
#include "ui_help.h"

Help::Help(QWidget *parent) :
    QDialog(parent),
    ui(new Ui::Help)
{
    ui->setupUi(this);

    ui->textBrowser->setHtml("<h1>Help</h1><ol><li> <a href = \"#menu\">Меню</a></li><ol><li><a href = \"#open\">Відкрити або створити базу даних</a></li><li><a href = \"#add_ckl\">Додати та видалити склад</a></li><li><a href = \"#add_tovar\">Додати та видалити товар</a></li></ol><li><a href = \"#func\"> Функціонал</a></li><ol><li><a href = \"#ckl\">dropdown склад</a></li><li><a href = \"#search\">Пошук</a></li><li><a href = \"#all\">Весь товар</a></li><li><a href = \"#left\">Залишки</a></li><li><a href = \"#end\">Закінчується</a></li><li><a href = \"#t\">Додати та списати товар</a></li><li><a href = \"#sort\">Сортування товарів у таблиці</a></li></ol></ol><h2 id=\"menu\">Меню</h2><h3 id = \"open\">Відкрити базу даних</h3><p>Здійснює відкривання вибраного користувачем файлу (.db) із діалогового вікна.<br>В базі даних повинні бути наявні 2 таблиці - tovar і storage.<br>Файл -> Відкрити базу даних<br>Ctrl + O</p><h3 id = \"add_ckl\">Додати та видалити склад</h3><p>Якщо база даних відкрита (див пункт 1.1) У пункті меню Настройки можна здійснити додавання або видалення складу. У діалоговому вікні що з'явиться потрібно ввести назву складу та натиснути Додати.Додавання та видалення відбудеться якщо такого складу немає або є відповіно.</p><h3 id=\"add_tovar\">Додати та видалити товар</h3><p>Здійснити додавання або видалення товару можна в Настройки->Додати товар, якшо база даних відкрита і склад додано\вибрано.<br>У вікні що з'явиться: <br>- для додавання товару потрібно заповнити всі поля;<br>- для видалення достатньо заповнити тільки одне;<br>- та натиснути кнопку;<br>Якшо такого товару не існує буде додано новий товар маса якого 0.<br>Видалення відбудеться за умови що такий товар є на вказаному складі.</p><h2 id = \"func\">Функціонал</h2>Для роботи всього функціоналу необхідно відкрити базу даних.<h3 id = \"ckl\"> Cклад</h3><p>Всі товари в програмі прив'язуються до складу. Його можна вибрати натиснувши по дропдауні та вибравши необхідний. Додати можна в меню Настройки->Додати склад.</p><h3 id = \"search\"> Cклад</h3><p>При зміні тексту в полі пошуку виводить всі знайдені товари з усіх складів у таблицю.</p><h3 id = \"all\"> Весь товар</h3><p>При натисканні виводить список усіх товарів з усіх складів у таблицю.</p><h3 id = \"left\"> Залишки</h3><p>При натисканні виводить список товарів маса яких більша 0 із вказаного складу у таблицю.</p><h3 id = \"end\"> Закінчується</h3><p>При натисканні виводить список товарів маса яких менша 100 із вказаного складу у таблицю.</p><h3 id = \"t\"> Додати та списати товар</h3><p>При натисканні з'являється діалогове вікно у якому можна додати або списати товар (+ або - кг). Списати можна тільки коли маса наявного товару більша ніж списувана.</p><h3 id = \"sort\"> Сортування товарів у таблиці</h3><p>При натисканні на заголовок таблиці при наявності хочаб одного товару у ній відбудеться сорутвання. Повторне натискання - у зворотньому напрямку. </p>");
}

Help::~Help()
{
    delete ui;
}
